# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'php@7.2'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'brave'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'grammarly'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'now'
cask 'phpstorm'
cask 'screenflow'
cask 'sequel-pro'
cask 'sip'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'tableplus'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lora'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Logic Pro X', id: 634148309
mas 'Pages', id:409201541
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Tyme 2', id: 1063996724
mas 'Wunderlist', id: 410628904
