# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@8.1'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'brave-browser'
cask 'cleanshot'
cask 'docker'
cask 'dropbox'
cask 'elgato-control-center'
cask 'expressvpn'
cask 'firefox'
cask 'gifox'
cask 'google-chrome'
cask 'grammarly'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'hyper'
cask 'adoptopenjdk'
cask 'now'
cask 'phpstorm'
cask 'ray'
cask 'raycast'
cask 'rectangle'
cask 'screenflow'
cask 'skype'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'tyme'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Logic Pro X', id: 634148309
mas 'Pages', id:409201541
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Tyme 3 - Time tracking', id: 1461456897
mas 'Unsplash Wallpapers', id: 1284863847
